IDEA StatiCa Open Model
ConnectionCheckRes.ConnectionID Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Guid of connection
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Guid ConnectionID { get; set; }
Public Property ConnectionID As Guid
	Get
	Set
public:
property Guid ConnectionID {
	Guid get ();
	void set (Guid value);
}
Property Value
Type: Guid
See Also
Reference
ConnectionCheckRes Class
IdeaRS.OpenModel.Connection Namespace